tap "ankane/brew"
tap "ariga/tap"
tap "atlassian/acli"
tap "atlassian/tap"
tap "bufbuild/buf"
tap "carvel-dev/carvel"
tap "chroju/tap"
tap "codekitchen/pipeline"
tap "deviceinsight/packages"
tap "fluxcd/tap"
tap "getgrit/tap"
tap "harelba/q"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "lacework/tap"
tap "mergestat/mergestat"
tap "norwoodj/tap"
tap "oven-sh/bun"
tap "saulpw/vd"
tap "sqitchers/sqitch"
tap "stefanprodan/tap"
tap "synfinatic/aws-sso-cli"
tap "test/claudia"
tap "tilt-dev/tap"
tap "tstapler/agrapha"
tap "tstapler/stapler-squad", "https://github.com/tstapler/stapler-squad"
tap "tstapler/stelekit", "https://github.com/tstapler/stelekit"
tap "vectordotdev/brew"
tap "xo/xo"
# Run your GitHub Actions locally
brew "act"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Static checker for GitHub Actions workflow files
brew "actionlint"
# OpenType text shaping engine
brew "harfbuzz"
# Apache ActiveMQ: powerful open source messaging server
brew "activemq"
# C parser in Python
brew "pycparser"
# C library SSHv1/SSHv2 client and server protocols
brew "libssh"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Automate deployment, configuration, and upgrading
brew "ansible"
brew "ansible-lint"
# Code searching, linting, rewriting
brew "ast-grep"
# Python frame stack sampler for CPython
brew "austin"
# Use AWS IAM credentials to authenticate to Kubernetes
brew "aws-iam-authenticator"
# Securely store and access AWS credentials in development environments
brew "aws-vault"
# Official Amazon AWS command-line interface
brew "awscli"
# User-friendly launcher for Bazel
brew "bazelisk"
# High performance key/value database
brew "berkeley-db"
# Python code formatter
brew "black"
# Open source, extensible AI agent that goes beyond code suggestions
brew "block-goose-cli"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Cloud Development Kit for Terraform
brew "cdktf"
# Control Google Chrome from the command-line
brew "chrome-cli"
# Manage multiple AI agents like Claude Code, Aider and Codex in your terminal
brew "claude-squad"
# Statistics utility to count lines of code
brew "cloc"
# Test your configuration files using Open Policy Agent
brew "conftest"
# Highly capable, feature-rich programming language
brew "perl"
# Fast CPAN module installer
brew "cpm"
# Validate and define text-based and dynamic configuration
brew "cue"
# C library implementing the SSH2 protocol
brew "libssh2"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Open source multi-tool for exploring and publishing data
brew "datasette"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Diff that understands syntax
brew "difftastic"
# Tool for exploring each layer in a docker image
brew "dive"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Text processing system for reStructuredText
brew "docutils"
# CLI tool for running SQL queries against JSON, CSV, Excel, Parquet, and more
brew "dsq"
# Build automation tool for the container era
brew "earthly"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Scriptable ping program for checking if multiple hosts are up
brew "fping"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# New file format for still image compression
brew "jpeg-xl"
# Library for encoding and decoding .avif files
brew "libavif"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Disk usage analyzer with console interface written in Go
brew "gdu"
# Disk Usage Analyzer (lower memory usage than gdu)
brew "dua-cli"
# GitHub command-line tool
brew "gh"
# Image processing and image analysis library
brew "leptonica"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Git extension for versioning large files
brew "git-lfs"
# Stacked PR workflow manager — keeps .git/machete layout, drives cascade rebases and PR base retargeting
brew "git-machete"
# Declarative configuration for Gmail filters
brew "gmailctl"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Fast linters runner for Go
brew "golangci-lint"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Modern, extensible Python project management
brew "hatch"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Curl statistics made simple
brew "httpstat"
# Modern alternative to the watch command
brew "hwatch"
# Friendly PIL fork (Python Imaging Library)
brew "pillow"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Convert images to PDF via direct JPEG inclusion
brew "img2pdf"
# JBIG2 encoder (for monochrome documents)
brew "jbig2enc"
# Git-compatible distributed version control system
brew "jj"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# CLI for managing Apache Kafka
brew "kafkactl"
# Compiler for generating binary data parsers
brew "kaitai-struct-compiler"
# User-friendly front-end to ssh-agent(1)
brew "keychain"
# Run local Kubernetes cluster in Docker
brew "kind"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Package manager for kubectl plugins
brew "krew"
# FAST Kubernetes manifests validator, with support for Custom Resources!
brew "kubeconform"
# Library for database change tracking
brew "liquibase"
# Access large language models from the command-line
brew "llm"
# Curses-based tool for viewing and analyzing log files
brew "lnav"
# Java-based project management
brew "maven"
# Fast and user friendly build system
brew "meson"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Open-source, cross-platform JavaScript runtime environment
brew "node@18"
# Adds an OCR text layer to scanned PDF files
brew "ocrmypdf"
# Create, run, and share large language models (LLMs)
brew "ollama", restart_service: :changed
# Open source, general-purpose policy engine
brew "opa"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Vulnerability scanner which uses the OSV database
brew "osv-scanner"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Shell command parallelization utility
brew "parallel"
# Small collection of programs that operate on patch files
brew "patchutils"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Draw UML diagrams
brew "plantuml"
# Tool for managing OCI containers and pods
brew "podman"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql@14"
# Object-relational database system
brew "postgresql@17"
# Command-line shell and scripting language
brew "powershell", link: false
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Cloud native development platform
brew "pulumi"
# Sampling profiler for Python programs
brew "py-spy"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Generic machine emulator and virtualizer
brew "qemu"
# Reverse engineering framework
brew "radare2"
# Command-line tool for working with AWS CloudFormation
brew "rain"
# File browser
brew "ranger"
# Rsync for cloud storage
brew "rclone"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Automated dependency updates. Flexible so you don't need to be
brew "renovate"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# CLI proxy to minimize LLM token consumption
brew "rtk"
# Modern Day Portscanner
brew "rustscan"
# Package Management Solution for Python
brew "rye"
# Soak up standard input and write to a file
brew "sponge"
# SQL linter and auto-formatter for Humans
brew "sqlfluff"
# Test SSL/TLS enabled services to discover supported cipher suites
brew "sslscan"
# Use SQL to instantly query your cloud services
brew "steampipe"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Tool to build, change, and version infrastructure
brew "terraform"
# Tool to generate documentation from Terraform modules
brew "terraform-docs"
# CLI tool to generate terraform files from existing infrastructure
brew "terraformer"
# Kubernetes-native framework for test definition and execution
brew "testkube"
# Linter for Terraform files
brew "tflint"
# Static analysis security scanner for your terraform code
brew "tfsec"
# Terminal multiplexer
brew "tmux"
# NetBSD's FTP client
brew "tnftp"
# File synchronization tool
brew "unison"
# Tool for writing command-line pipes with instant live preview
brew "up"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Watch files and take action when they change
brew "watchman"
# Bundler for JavaScript and friends
brew "webpack"
# Internet file retriever
brew "wget"
# Network analyzer and capture tool - without graphical user interface
brew "wireshark"
# Fast CSV toolkit written in Rust
brew "xsv"
# Linter for YAML files
brew "yamllint"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Availability and monitoring solution
brew "zabbix"
# Centralized server for distributed coordination of services
brew "zookeeper"
# Scan your data stores for unencrypted personal data (PII)
brew "ankane/brew/pdscan"
# A database toolkit
brew "ariga/tap/atlas"
# Software to interact with Atlassian Cloud from the terminal
brew "atlassian/acli/acli"
# The best way of working with Protocol Buffers.
brew "bufbuild/buf/buf"
# Ytt
brew "carvel-dev/carvel/ytt"
# Terraform Cloud CLI tool
brew "chroju/tap/tfcloud"
# Interactive prompt for building up a pipeline of shell commands
brew "codekitchen/pipeline/pipeline"
# Flux CLI
brew "fluxcd/tap/flux", link: false
# Flux CLI
brew "fluxcd/tap/flux@0.41", link: true
# GritQL is a query language for searching, linting, and modifying code
brew "getgrit/tap/grit"
# Run SQL directly on CSV or TSV files, and on multiple sqlite databases
brew "harelba/q/q"
# Lacework command-line interface helps to manage the Lacework platform
brew "lacework/tap/lacework-cli"
# Query git repositories with SQL. Generate reports, perform status checks, analyze codebases. 🔍 📊
brew "mergestat/mergestat/mergestat"
# Automatically generate markdown documentation for helm charts
brew "norwoodj/tap/helm-docs"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Terminal utility for exploring and arranging tabular data
brew "saulpw/vd/visidata"
# Timoni CLI
brew "stefanprodan/tap/timoni"
# A dev environment as code for microservice apps
brew "tilt-dev/tap/tilt"
# Manage multiple AI terminal agents like Claude Code, Aider, Codex, OpenCode, and Amp.
brew "tstapler/stapler-squad/stapler-squad"
# Markdown-based outliner and note-taking app (Kotlin Multiplatform)
brew "tstapler/stelekit/stelekit", link: false
# A High-Performance Log, Metrics, and Events Router
brew "vectordotdev/brew/vector"
# universal command-line SQL client interface
brew "xo/xo/usql"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Local-first meeting transcription for your memory system
cask "tstapler/agrapha/agrapha"
# GraphQL client
cask "altair-graphql-client"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
# Open source, extensible AI agent that goes beyond code suggestions
cask "block-goose"
# Web security testing toolkit
cask "burp-suite"
# API documentation browser and code snippet manager
cask "dash"
# Universal database tool and SQL client
cask "dbeaver-community"
# Voice and text chat software
cask "discord"
# Web browser
cask "firefox"
# Screenshot software with built-in annotation tools
cask "flameshot"
cask "gifcapture"
# Desktop client for GitHub repositories
cask "github"
# HTTP and GraphQL Client
cask "insomnia"
# Java IDE by JetBrains
cask "intellij-idea"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Open-source screen recorder built with web technology
cask "kap"
# Utility for comparing and merging files and directories
cask "kdiff3"
# Visual diff and merge tool
cask "meld"
# GUI app and toolkit for Claude Code
cask "opcode"
# Administration and development platform for PostgreSQL
cask "pgadmin4"
# Command-line shell and scripting language
cask "powershell"
# Kubernetes and container management on the desktop
cask "rancher"
# Plugin for AWS CLI to start and end sessions that connect to managed instances
cask "session-manager-plugin"
# Music streaming service
cask "spotify"
# Rust-based terminal
cask "warp"
# Free and open source web app scanner
cask "zap"
uv "cookiecutter"
uv "litellm[prisma-client,proxy]"
uv "wt-cli"
krew "sniff"
# claude-code is installed as a native binary by the `claude` Ansible role.
# The npm wrapper shadows it on PATH and ships a broken native shim, so it is
# intentionally not installed here.
npm "corepack"
