{
  "FastFold": { "branch": "master" },
  "NrrwRgn": { "branch": "master" },
  "fzf-lua": { "branch": "main" },
  "gitsigns.nvim": { "branch": "main" },
  "goyo.vim": { "branch": "master" },
  "gruvbox.nvim": { "branch": "main" },
  "lazy.nvim": { "branch": "main" },
  "limelight.vim": { "branch": "master" },
  "lualine.nvim": { "branch": "master" },
  "nvim-treesitter": { "branch": "master" },
  "nvim-treesitter-textobjects": { "branch": "master" },
  "oil.nvim": { "branch": "master" },
  "tabular": { "branch": "master" },
  "undotree": { "branch": "master" },
  "vim-abolish": { "branch": "master" },
  "vim-commentary": { "branch": "master" },
  "vim-fugitive": { "branch": "master" },
  "vim-gnupg": { "branch": "main" },
  "vim-grammarous": { "branch": "master" },
  "vim-oscyank": { "branch": "main" },
  "vim-pandoc": { "branch": "master" },
  "vim-pandoc-after": { "branch": "master" },
  "vim-pandoc-syntax": { "branch": "master" },
  "vim-repeat": { "branch": "master" },
  "vim-sort-motion": { "branch": "master" },
  "vim-speeddating": { "branch": "master" },
  "vim-startuptime": { "branch": "master" },
  "vim-surround": { "branch": "master" },
  "vim-table-mode": { "branch": "master" },
  "vim-titlecase": { "branch": "master" },
  "vim-visual-increment": { "branch": "master" },
  "vim-zenroom2": { "branch": "master" },
  "vim-zettel": { "branch": "master" },
  "vimwiki": { "branch": "master" },
  "which-key.nvim": { "branch": "main" }
}
